class Errors:
    @staticmethod
    def smt_went_wrong():
        return "Что то пошло не так, извините, попробуйте еще раз или напишите нам"

    @staticmethod
    def strange_member():
        return "Похоже, что то сломалось, я не смог вас узнать, напишите, пожалуйста, в чат поддержки (ссылка на чат поддержки)"

    @staticmethod
    def cant_find_meeting():
        return "Похоже, что то сломалось, я не смог найти встречу, на которую вы хотите записаться( Напишите в чат поддержки (ссылка на чат поддержки)"

    @staticmethod
    def booking_error():
        return "Произошла какая-то ошибка при записи, не могу с ней разобраться сам, напишите в чат поддержки (ссылка на чат поддержки) или попробуйте снова чуть позже"

    @staticmethod
    def subs_error():
        return "Произошла какая-то ошибка при покупке абонемента, не могу с ней разобраться сам, напишите в чат поддержки (ссылка на чат поддержки)"


    @staticmethod
    def try_one_more_time():
        return "Попробуйте записаться еще раз"
